l = [
	[34587, 'Learning Python, Mark Lutz', 4, 40.95],
	[98762, 'Programming Python, Mark Lutz', 5, 56.80],
	[77226, 'Head First Python, Paul Barry', 3, 32.95],
	[88112, 'Einfuhrung in Python3, Bernd Klein', 3, 24.99]
]
print(l)
i = list(map(lambda x: (f'Номер заказа: {x[0]}',f'Стоимость заказа: {round(x[-1] * x[-2],2) if round(x[-1] * x[-2],2) > 100 else round(x[-1] * x[-2] +10,2)}'), l))
print(i)

# ниже с переносом
# i = list(map(lambda x: (f'Номер заказа: {x[0]}',f'Стоимость заказа:\
# {round(x[-1] * x[-2],2) if round(x[-1] * x[-2],2) > 100 else round(x[-1] * x[-2] +10,2)}'), l))
# print(i)

# Условие:
# 1. Представьте себе бухгалтерскую книгу в книжном магазине. В этой книге хранятся
# записи о номере заказа, названии книги, количестве и стоимости одной книги, как
# представлено ниже, в таблице.
#
# +--------------+------------------------------------+----------+----------------+
# | Order Number |       Book Title and Author        | Quantity | Price per Item |
# +--------------+------------------------------------+----------+----------------+
# |        34587 | Learning Python, Mark Lutz         |        4 |          40.95 |
# |        98762 | Programming Python, Mark Lutz      |        5 |          56.80 |
# |        77226 | Head First Python, Paul Barry      |        3 |          32.95 |
# |        88112 | Einfuhrung in Python3, Bernd Klein |        3 |          24.99 |
# +--------------+------------------------------------+----------+----------------+
#
# Напишите программу на Python, которая на вход получает список списков:
# [
# 	[34587, 'Learning Python, Mark Lutz', 4, 40.95],
# 	[98762, 'Programming Python, Mark Lutz', 5, 56.80],
# 	[77226, 'Head First Python, Paul Barry', 3, 32.95],
# 	[88112, 'Einfuhrung in Python3, Bernd Klein', 3, 24.99]
# ]
#
# !!!и возвращает список кортежей. Каждый кортеж состоит из номера заказа и произведения
# !!!цены на товары и количества. Стоимость заказа должна быть увеличена на $10, если она меньше $100. Программа должна\
# !!!использовать lambda, map, однострочный if, round и list.
