o = 0
s = 0
a1 = 0
a2 = 0
print('Введите числа: ')
n = int(input())
r1 = n
r2 = n
if n == 0:
    print('Введите несколько значений, перед тем как ввести 0.')
else:
    while n != 0:
        if n == 0:
            break
        o += 1
        s += n
        if (n % 2) == 0:
            a1 += 1
        else:
            a2 += 1
        k = s / o
        if n < r1:
            r1 = n
        if n > r2:
            r2 = n
        n = int(input())
    print(f'Кол-во чисел: {o}, сумма чисел: {s}, среднее арифметическое чисел: {k:.2f}, минимальное значение:\
{r1}, максимальное значение: {r2}, кол-во четных чисел: {a1}, нечетных: {a2}.')